---
type: CategoryNameMapIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# CategoryNameMapIterator

`Autodesk.Revit.DB.CategoryNameMapIterator` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CategoryNameMapIterator | — | `public CategoryNameMapIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |
| Property | Key | — | `public virtual string Key { get ; }` |